// ДЗ 4.1. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
Console.WriteLine("Инициализация программы");
Console.Write("Введите число: ");
